Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Profile Name
fr: Nom du profil
ko: 프로필 이름
tr: Profil Adı
vi: Tên hồ sơ
zh_hans: 配置名称
zh_hant: 設定檔名稱

source: Maximum time to wait for a query to complete. Set to 0 for no limit. Applied to new connections.
fr: Temps maximum d'attente pour que une requête soit terminée. Définie à 0 pour aucune limite. Appliquée aux nouvelles connexions.
ko: 쿼리 완료를 기다리는 최대 시간입니다. 제한하지 않으려면 0으로 설정하십시오. 새 연결에 적용됩니다.
tr: Sorgunun tamamlanması için beklenecek maksimum süre. Sınır olmaması için 0 yapın. Yeni bağlantılara uygulanır.
vi: Thời gian chờ tối đa để truy vấn hoàn thành. Đặt 0 để không giới hạn. Áp dụng cho kết nối mới.
zh_hans: 等待查询完成的最长时间。设为 0 表示不限制。应用于新连接。
zh_hant: 等待查詢完成的最長時間。設為 0 表示不限制。套用至新連線。

source: Close “%@”
fr: Fermer "%@"
ko: “%@” 닫기
tr: “%@” Bağlantısını Kapat
vi: Đóng “%@”
zh_hans: 关闭“%@”
zh_hant: 關閉「%@」

source: Remove from Sidebar
fr: Supprimer de la barre latérale
ko: 사이드바에서 제거
tr: Sidebar'dan Kaldır
vi: Gỡ khỏi thanh bên
zh_hans: 从侧边栏移除
zh_hant: 從側邊欄移除

source: This file is not a library.
fr: Ce fichier n'est pas une bibliothèque.

source: List the schemas inside one database, sorted by name.
fr: Listez les schémas à l'intérieur d'une base de données, triés par nom.
ko: 한 데이터베이스 안의 스키마를 이름순으로 나열합니다.
tr: Bir veritabanının içindeki şemaları ada göre sıralayarak listeler.
vi: Liệt kê các schema bên trong một cơ sở dữ liệu, sắp xếp theo tên.
zh_hans: 列出某个数据库中的 Schema，按名称排序。
zh_hant: 列出某個資料庫中的綱要，按名稱排序。

source: This is not valid JavaScript.
fr: Ce n'est pas un JavaScript valide.

source: Add Check Constraint
fr: Ajouter une contrainte de vérification
ko: 체크 제약 조건 추가
tr: Kontrol Kısıtı Ekle
vi: Thêm ràng buộc kiểm tra
zh_hans: 添加检查约束
zh_hant: 新增檢查約束

source: Diagram
fr: Diagramme
ko: 다이어그램
tr: Diyagram
vi: Sơ đồ
zh_hans: 图表
zh_hant: 圖表

source: Sponsor TablePro
fr: Parrainer TablePro
ko: TablePro 후원
vi: Tài trợ TablePro
zh_hans: 赞助 TablePro
zh_hant: 贊助 TablePro

source: Authenticating %@
fr: Authentification de %@
ko: %@ 인증 중
tr: %@ kimliği doğrulanıyor
vi: Đang xác thực %@
zh_hans: 正在验证 %@
zh_hant: 正在驗證 %@

source: Server round trip in milliseconds
fr: Itération du serveur aller-retour en millisecondes
ko: 밀리초 단위 서버 왕복 시간
tr: Milisaniye cinsinden sunucu gidiş dönüş süresi
vi: Thời gian khứ hồi tới máy chủ tính bằng mili giây
zh_hans: 以毫秒计的服务器往返时间
zh_hant: 以毫秒計的伺服器往返時間

source: Partition name
fr: Nom de la partition

source: Generate a token so external clients can connect with their own credentials.
fr: Générez un jeton afin que les clients externes puissent se connecter avec leurs propres identifiants.
ko: 외부 클라이언트가 자체 자격 증명으로 연결할 수 있도록 토큰을 생성합니다.
tr: Harici istemcilerin kendi kimlik bilgileriyle bağlanabilmesi için bir token oluşturun.
vi: Tạo token để client bên ngoài có thể kết nối bằng thông tin xác thực của riêng họ.
zh_hans: 生成令牌，让外部客户端使用自己的凭据进行连接。
zh_hant: 產生權杖,讓外部用戶端可使用自己的憑證連線。

source: Ask Once for Each Connection
fr: Demandez une seule fois pour chaque connexion.

source: "%@" was deleted or moved.
fr: «%@» a été supprimé ou déplacé.
ko: "%@" 항목이 삭제되었거나 이동되었습니다.
tr: "%@" silindi veya taşındı.
vi: "%@" đã bị xoá hoặc di chuyển.
zh_hans: "%@"已被删除或移动。
zh_hant: 「%@」已被刪除或移動。

source: Replace the original statement in the editor with the suggested SQL
fr: Remplacez l'instruction originale dans l'éditeur par la SQL suggérée.

source: Query results
fr: Résultats de la requête

source: Stop Export?
fr: Arrêter l'exportation ?
ko: 내보내기를 중지하시겠습니까?
tr: Dışa Aktarma Durdurulsun mu?
vi: Dừng xuất?
zh_hans: 停止导出？
zh_hant: 停止匯出？

source: Auto-detects from ~/.ssh/config and default key locations.
fr: Auto-détecte à partir de ~/.ssh/config et des emplacements par défaut des clés.
ko: ~/.ssh/config 및 기본 키 위치에서 자동으로 감지합니다.
tr: ~/.ssh/config ve varsayılan anahtar konumlarından otomatik algılanır.
vi: Tự động phát hiện từ ~/.ssh/config và các vị trí key mặc định.
zh_hans: 自动从 ~/.ssh/config 和默认密钥位置检测。
zh_hant: 自動從 ~/.ssh/config 和預設金鑰位置偵測。

source: Cell value: string, number, boolean, or null
fr: Valeur de la cellule : chaîne, nombre, booléen ou nul
ko: 셀 값: 문자열, 숫자, 불리언 또는 null
tr: Hücre değeri: dize, sayı, boole veya null
vi: Giá trị ô: chuỗi, số, boolean hoặc null
zh_hans: 单元格值：字符串、数字、布尔值或 null
zh_hant: 儲存格值：字串、數字、布林值或 null

source: Unsigned
fr: Non signé
ko: 서명되지 않음
vi: Không dấu
zh_hans: 无符号
zh_hant: 無符號

source: Replace it
fr: Remplacez-le

source: Copy Bound
fr: Copie reliée

source: Claude Code is installed but not signed in.
fr: Claude Code est installé mais pas connecté.
ko: Claude Code가 설치되어 있지만 로그인되어 있지 않습니다.
tr: Claude Code yüklü ancak oturum açılmamış.
vi: Claude Code đã được cài nhưng chưa đăng nhập.
zh_hans: 已安装 Claude Code，但尚未登录。
zh_hant: 已安裝 Claude Code，但尚未登入。

source: Acknowledgements
fr: Reconnaissances
ko: 감사의 글
tr: Teşekkürler
vi: Ghi nhận
zh_hans: 致谢
zh_hant: 致謝

source: Partial files may remain on disk.
fr: Les fichiers partiels peuvent rester sur le disque.
ko: 일부 파일이 디스크에 남아 있을 수 있습니다.
tr: Diskte kısmi dosyalar kalabilir.
vi: Các tệp dở dang có thể vẫn còn trên ổ đĩa.
zh_hans: 部分文件可能仍留在磁盘上。
zh_hant: 磁碟上可能殘留部分檔案。

source: Clear Query
fr: Supprimer la requête
ko: 쿼리 지우기
tr: Sorguyu Temizle
vi: Xoá truy vấn
zh_hans: 清除查询
zh_hant: 清除查詢

source: Reset to Defaults
fr: Réinitialiser aux paramètres par défaut
ko: 기본값으로 재설정
tr: Varsayılana Sıfırla
vi: Khôi phục mặc định
zh_hans: 恢复默认
zh_hant: 重設為預設值

source: ISO 8601 creation time
fr: Temps de création ISO 8601
ko: ISO 8601 생성 시각
tr: ISO 8601 oluşturulma zamanı
vi: Thời điểm tạo theo ISO 8601
zh_hans: ISO 8601 创建时间
zh_hant: ISO 8601 建立時間

source: Query history for %@
fr: Historique des requêtes pour %@
ko: %@의 쿼리 기록
tr: %@ için sorgu geçmişi
vi: Lịch sử truy vấn của %@
zh_hans: %@的查询历史
zh_hant: %@的查詢記錄

source: Name this selection
fr: Nommez cette sélection

source: List schemas in a database
fr: Liste des schémas dans une base de données
ko: 데이터베이스의 스키마 나열
tr: Bir veritabanındaki şemaları listele
vi: Liệt kê schema trong một cơ sở dữ liệu
zh_hans: 列出数据库中的 Schema
zh_hant: 列出資料庫中的綱要

source: Copy Connection ID
fr: Copier l'identifiant de connexion
ko: 연결 ID 복사
tr: Bağlantı Kimliğini Kopyala
vi: Sao chép ID kết nối
zh_hans: 复制连接ID
zh_hant: 複製連線 ID

source: New %@ (⌘N)
fr: Nouveau %@ (⌘N)
ko: 새 %@ (⌘N)
tr: Yeni %@ (⌘N)
vi: %@ mới (⌘N)
zh_hans: 新建 %@ (⌘N)
zh_hant: 新增 %@ (⌘N)

source: Run a maintenance operation the engine supports, on one table or on the whole database. TablePro generates the statements; the user approves them. Needs tools:write.
fr: Effectuez une opération de maintenance prise en charge par le moteur, sur une seule table ou sur toute la base de données. TablePro génère les déclarations ; l'utilisateur les approuve. Besoin d'outils : write.
ko: 엔진이 지원하는 유지 관리 작업을 한 테이블 또는 데이터베이스 전체에 실행합니다. TablePro가 명령문을 생성하고 사용자가 승인합니다. tools:write가 필요합니다.
tr: Motorun desteklediği bir bakım işlemini tek bir tabloda veya veritabanının tamamında çalıştırır. İfadeleri TablePro üretir; kullanıcı onaylar. tools:write gerektirir.
vi: Chạy một thao tác bảo trì mà engine hỗ trợ, trên một bảng hoặc trên toàn bộ cơ sở dữ liệu. TablePro tạo ra các câu lệnh; người dùng phê duyệt chúng. Cần tools:write.
zh_hans: 在一张表或整个数据库上运行该引擎支持的维护操作。语句由 TablePro 生成，由用户批准。需要 tools:write。
zh_hant: 在一張資料表或整個資料庫上執行該引擎支援的維護作業。陳述式由 TablePro 產生，由使用者核准。需要 tools:write。

source: Large
fr: Grand
ko: 큼
tr: Büyük
vi: Lớn
zh_hans: 大
zh_hant: 大

# Schema tour of %@ on %@
source: Schema tour of %1$@ on %2$@
fr: Tour du schéma de %1$@ sur %2$@
ko: %2$@의 %1$@ 스키마 둘러보기
tr: %2$@ üzerindeki %1$@ şema turu
vi: Tham quan schema %1$@ trên %2$@
zh_hans: %2$@ 上 %1$@ 的 Schema 导览
zh_hant: %2$@ 上 %1$@ 的綱要導覽

source: Pass 'sql_table' to name the table the INSERT statements target.
fr: Fournissez 'sql_table' pour nommer la table ciblée par les instructions INSERT.
ko: INSERT 명령문의 대상 테이블을 지정하려면 'sql_table'을 전달하십시오.
tr: INSERT ifadelerinin hedeflediği tabloyu adlandırmak için 'sql_table' geçirin.
vi: Hãy truyền 'sql_table' để đặt tên bảng đích của các câu lệnh INSERT.
zh_hans: 请传入 'sql_table' 来指定 INSERT 语句的目标表。
zh_hant: 請傳入 'sql_table' 來指定 INSERT 陳述式的目標資料表。

source: Permission
fr: Autorisation
ko: 권한
tr: İzin
vi: Quyền
zh_hans: 权限
zh_hant: 權限

source: Delete Folder
fr: Supprimer le dossier
ko: 폴더 삭제
tr: Klasörü Sil
vi: Xoá thư mục
zh_hans: 删除文件夹
zh_hant: 刪除資料夾

source: Hosted libSQL over HTTP
fr: LibSQL hébergé via HTTP

source: A connection can use one tunnel at a time. Disable the SSH Tunnel to use a Cloudflare Tunnel.
fr: Une connexion peut utiliser un tunnel à la fois. Désactivez le tunnel SSH pour utiliser un tunnel Cloudflare.
ko: 한 연결에서는 한 번에 하나의 터널만 사용할 수 있습니다. Cloudflare 터널을 사용하려면 SSH 터널을 비활성화하십시오.
tr: Bir bağlantı aynı anda yalnızca bir tünel kullanabilir. Cloudflare Tüneli kullanmak için SSH Tünelini devre dışı bırakın.
vi: Mỗi kết nối chỉ dùng được một tunnel. Tắt SSH Tunnel để dùng Cloudflare Tunnel.
zh_hans: 一个连接一次只能使用一个隧道。请停用SSH隧道以使用Cloudflare隧道。
zh_hant: 一個連線一次只能使用一個隧道。請停用 SSH 隧道以使用 Cloudflare 隧道。

source: List Indexes
fr: Index de liste
ko: 인덱스 목록
tr: İndeksleri Listele
vi: Liệt kê chỉ mục
zh_hans: 列出索引
zh_hant: 列出索引

source: The %1$@ plugin could not be installed: %2$@
fr: Le plugin %1$@ n'a pas pu être installé : %2$@

source: Every difference in the included tables is switched off in Options or excluded row by row.
fr: Chaque différence dans les tableaux inclus est désactivée dans les options ou exclue ligne par ligne.

source: CLI Paths
fr: Chemins CLI
ko: CLI 경로
tr: CLI Yolları
vi: Đường dẫn CLI
zh_hans: CLI 路径
zh_hant: CLI 路徑

source: Clear search
fr: Effacer la recherche
ko: 검색 지우기
tr: Aramayı temizle
vi: Xóa tìm kiếm
zh_hans: 清除搜索
zh_hant: 清除搜尋

source: Create Connection…
fr: Créer une connexion...
ko: 연결 생성…
tr: Bağlantı Oluştur…
vi: Tạo kết nối…
zh_hans: 创建连接…
zh_hant: 建立連線…

source: Backslash \
fr: Caractère de rétroslash \
ko: 백슬래시 \
tr: Ters Eğik Çizgi \
vi: Gạch chéo ngược \
zh_hans: 反斜杠 \
zh_hant: 反斜線 \

source: Show All
fr: Afficher tout
ko: 모두 보기
tr: Tümünü Göster
vi: Hiển thị tất cả
zh_hans: 显示全部
zh_hant: 顯示全部

source: Failed to generate TLS private key
fr: Échec de la génération du clé privée TLS
ko: TLS 개인 키를 생성하지 못했습니다
tr: TLS özel anahtarı oluşturulamadı
vi: Không tạo được TLS private key
zh_hans: 生成 TLS 私钥失败
zh_hant: 產生 TLS 私密金鑰失敗

source: AI Provider
fr: Fournisseur d'IA
ko: AI 제공업체
tr: Yapay Zeka Sağlayıcısı
vi: Nhà cung cấp AI
zh_hans: AI 提供商
zh_hant: AI 供應商

source: This will fetch approximately %@ more rows. Large result sets use significant memory. Continue?
fr: Cela récupérera environ %@ de lignes supplémentaires. Les ensembles de résultats volumineux consomment une mémoire importante. Continuer ?
ko: 약 %@개의 행을 더 가져옵니다. 결과 집합이 크면 상당한 메모리를 사용합니다. 계속하시겠습니까?
tr: Yaklaşık %@ satır daha getirilecek. Büyük sonuç kümeleri önemli bellek kullanır. Devam edilsin mi?
vi: Thao tác này sẽ tải thêm khoảng %@ dòng. Tập kết quả lớn sử dụng nhiều bộ nhớ. Tiếp tục?
zh_hans: 此操作将获取约 %@ 行更多数据。大量结果会占用较多内存。是否继续？
zh_hant: 此操作將額外擷取約 %@ 列。大量結果集會佔用大量記憶體。是否繼續？

source: %1$@ could not represent %2$@. Each was written as "?".
fr: %1$@ ne pouvait pas représenter %2$@. Chacun a été écrit comme "?".
ko: %1$@에서 %2$@을(를) 표현할 수 없어 각각 "?"로 기록했습니다.
tr: %1$@ şunları temsil edemedi: %2$@. Her biri "?" olarak yazıldı.
vi: %1$@ không thể biểu diễn %2$@. Mỗi ký tự được ghi thành "?".
zh_hans: %1$@ 无法表示 %2$@。每个字符均写为 "?"。
zh_hant: %1$@ 無法表示 %2$@。每個字元均寫為 "?"。

source: Suggest indexes for a slow query from its plan and the indexes the tables already have
fr: Suggestion d'index pour une requête lente à partir de son plan et des indices que les tables ont déjà.
ko: 실행 계획과 테이블에 이미 있는 인덱스를 바탕으로 느린 쿼리에 필요한 인덱스를 제안합니다
tr: Yavaş bir sorgu için, planından ve tabloların hâlihazırda sahip olduğu indekslerden yola çıkarak indeks önerir
vi: Đề xuất chỉ mục cho một truy vấn chậm, dựa trên kế hoạch thực thi và những chỉ mục các bảng đã có
zh_hans: 根据执行计划以及表上已有的索引，为慢查询建议索引
zh_hant: 根據執行計畫以及資料表上已有的索引，為慢查詢建議索引

source: Forwards a port from a Kubernetes resource with kubectl port-forward.
fr: Redirige un port à partir d'une ressource Kubernetes avec kubectl port-forward.

source: %1$lld rows from %3$lld tables written to %2$@.
fr: %1$lld lignes de %3$lld tables écrites à %2$@.

source: Filter Databases…
fr: Filtre les bases de données...
ko: 데이터베이스 필터링…
tr: Veritabanlarını Filtrele…
vi: Lọc cơ sở dữ liệu…
zh_hans: 筛选数据库…
zh_hant: 篩選資料庫…

source: Tables and columns of the database this connection is browsing
fr: Tables et colonnes de la base de données que cette connexion consulte.
ko: 이 연결이 탐색 중인 데이터베이스의 테이블과 열
tr: Bu bağlantının göz attığı veritabanının tabloları ve sütunları
vi: Các bảng và cột của cơ sở dữ liệu mà kết nối này đang duyệt
zh_hans: 此连接正在浏览的数据库的表和列
zh_hant: 此連線正在瀏覽的資料庫的資料表和欄位

source: No active database connection
fr: Aucune connexion active à la base de données
ko: 활성 데이터베이스 연결 없음
tr: Aktif veritabanı bağlantısı yok
vi: Không có kết nối cơ sở dữ liệu
zh_hans: 没有活动的数据库连接
zh_hant: 沒有使用中的資料庫連線

source: Runs against
fr: Course contre

source: Add Foreign Key
fr: Ajouter une clé étrangère
ko: 외래 키 추가
tr: Yabancı Anahtar Ekle
vi: Thêm khóa ngoại
zh_hans: 添加外键
zh_hant: 新增外鍵

source: %1$lld of %2$lld statements were already written, and %3$@ cannot roll them back.
fr: %1$lld des déclarations de %2$lld ont déjà été écrites, et %3$@ ne peut pas les rétrograder.
ko: %2$lld개 명령문 중 %1$lld개가 이미 기록되었으며, %3$@은(는) 이를 롤백할 수 없습니다.
tr: %2$lld ifadeden %1$lld tanesi zaten yazıldı ve %3$@ bunları geri alamıyor.
vi: %1$lld trên %2$lld câu lệnh đã được ghi, và %3$@ không thể rollback chúng.
zh_hans: %2$lld 条语句中已有 %1$lld 条写入，%3$@ 无法回滚它们。
zh_hant: %2$lld 條陳述式中已有 %1$lld 條寫入，%3$@ 無法回復它們。

source: Number
fr: Numéro
ko: 숫자
tr: Sayı
vi: Số
zh_hans: 数字
zh_hant: 數字

source: Privileges
fr: Privilèges
ko: 권한
tr: Yetkiler
vi: Quyền
zh_hans: 权限
zh_hant: 權限

source: %lld ^[table](inflect: true) to export
fr: %lld ^[table](inflect: true) pour exporter

source: Silent
fr: Silencieux
ko: 알림 없음
vi: Im lặng
zh_hans: 静默
zh_hant: 靜音

source: Summary
fr: Résumé
ko: 요약
tr: Özet
vi: Tóm tắt
zh_hans: 摘要
zh_hant: 摘要

source: The SSH server would not forward the socket %1$@. Check that the path exists on the server and that sshd allows socket forwarding (AllowStreamLocalForwarding). (%2$@)
fr: Le serveur SSH ne renvoyait pas le socket %1$@. Vérifiez que le chemin existe sur le serveur et que sshd autorise le renvoi du socket (AllowStreamLocalForwarding). (%2$@)
ko: SSH 서버에서 소켓 %1$@ 전달을 허용하지 않았습니다. 서버에 해당 경로가 있는지, sshd에서 소켓 전달(AllowStreamLocalForwarding)을 허용하는지 확인하십시오. (%2$@)
tr: SSH sunucusu %1$@ soketini yönlendirmedi. Yolun sunucuda var olduğunu ve sshd'nin soket yönlendirmeye izin verdiğini denetleyin (AllowStreamLocalForwarding). (%2$@)
vi: Máy chủ SSH không chuyển tiếp socket %1$@. Hãy kiểm tra đường dẫn có tồn tại trên máy chủ và sshd có cho phép chuyển tiếp socket không (AllowStreamLocalForwarding). (%2$@)
zh_hans: SSH 服务器未转发 socket %1$@。请检查该路径在服务器上是否存在，以及 sshd 是否允许 socket 转发（AllowStreamLocalForwarding）。(%2$@)
zh_hant: SSH 伺服器未轉送 socket %1$@。請檢查該路徑在伺服器上是否存在，以及 sshd 是否允許 socket 轉送（AllowStreamLocalForwarding）。(%2$@)

source: STATISTICS
fr: Statistiques
ko: 통계
vi: THỐNG KÊ
zh_hans: 统计信息
zh_hant: 統計資訊

source: Turn loaded query results into native bar, line, area, and scatter charts.
fr: Transforme les résultats de la requête chargée en graphiques de barre, de ligne, d'aire et de dispersion natifs.
ko: 불러온 쿼리 결과를 막대, 선, 영역, 분산형 차트로 그립니다.
tr: Yüklenen sorgu sonuçlarını yerel çubuk, çizgi, alan ve dağılım grafiklerine dönüştürün.
vi: Chuyển kết quả truy vấn đã tải thành biểu đồ cột, đường, miền và phân tán theo chuẩn hệ thống.
zh_hans: 将已加载的查询结果转换为原生柱状图、折线图、面积图和散点图。
zh_hant: 將已載入的查詢結果轉換為原生長條圖、折線圖、面積圖和散佈圖。

source: Rename…
fr: Renommer...
ko: 이름 변경…
tr: Yeniden Adlandır…
vi: Đổi tên…
zh_hans: 重命名…
zh_hant: 重新命名…

source: Connection: %@
fr: Connexion : %@
ko: 연결: %@
tr: Bağlantı: %@
vi: Kết nối: %@
zh_hans: 连接：%@
zh_hant: 連線：%@

source: GitHub Repository
fr: Réposoir GitHub
ko: GitHub 저장소
tr: GitHub Deposu
vi: Kho GitHub
zh_hans: GitHub 仓库
zh_hant: GitHub 儲存庫

source: Remove Linked Folder?
fr: Supprimer le dossier lié ?
ko: 연결된 폴더를 제거하시겠습니까?
tr: Bağlı Klasör Kaldırılsın mı?
vi: Gỡ thư mục liên kết?
zh_hans: 要移除链接的文件夹吗？
zh_hant: 要移除連結的資料夾嗎？

source: Signed in
fr: Connecté
ko: 로그인됨
tr: Giriş yapıldı
vi: Đã đăng nhập
zh_hans: 已登录
zh_hant: 已登入

source: Nothing is selected to apply.
fr: Rien n'est sélectionné pour être appliqué.
ko: 적용할 항목이 선택되지 않았습니다.
tr: Uygulanacak bir şey seçilmedi.
vi: Chưa chọn gì để áp dụng.
zh_hans: 未选择任何要应用的内容。
zh_hant: 未選擇任何要套用的內容。

source: Agent mode calls tools in a loop until it finishes or hits this limit, then pauses so you can continue. Raising it costs more tokens per reply.
fr: La mode agent appelle les outils dans un boucle jusqu'à ce qu'ils se terminent ou atteignent cette limite, puis s'arrête pour que vous puissiez continuer. L'augmenter coûte plus de jetons par réponse.
ko: 에이전트 모드는 완료되거나 이 제한에 도달할 때까지 도구를 반복 호출한 후, 계속할 수 있도록 일시 정지합니다. 제한을 높이면 응답당 더 많은 토큰이 소모됩니다.
tr: Agent modu, iş bitene veya bu limite ulaşılana kadar araçları döngüde çağırır, sonra devam edebilmeniz için duraklar. Limiti yükseltmek yanıt başına daha fazla token harcar.
vi: Chế độ agent gọi công cụ theo vòng lặp cho đến khi xong hoặc chạm giới hạn này, rồi tạm dừng để bạn tiếp tục. Tăng giới hạn sẽ tốn nhiều token hơn cho mỗi câu trả lời.
zh_hans: Agent 模式会循环调用工具，直到完成或达到此上限，然后暂停等你继续。上限越高，每条回复消耗的 token 越多。
zh_hant: Agent 模式會循環呼叫工具，直到完成或達到此上限，然後暫停等你繼續。上限越高，每則回覆消耗的 token 越多。

source: Failed to load databases
fr: Échec du chargement des bases de données
ko: 데이터베이스를 불러오지 못했습니다
tr: Veritabanları yüklenemedi
vi: Tải danh sách cơ sở dữ liệu thất bại
zh_hans: 加载数据库列表失败
zh_hant: 載入資料庫清單失敗

source: Identity File
fr: Fichier d'identité

source: Blocked
fr: Bloqué
ko: 차단됨
tr: Engellendi
vi: Đã chặn
zh_hans: 已阻止
zh_hant: 已封鎖

source: List all saved database connections with their status
fr: Liste toutes les connexions de base de données enregistrées avec leur statut.
ko: 저장된 모든 데이터베이스 연결과 상태 나열
tr: Kayıtlı tüm veritabanı bağlantılarını durumlarıyla listele
vi: Liệt kê tất cả kết nối cơ sở dữ liệu đã lưu cùng trạng thái
zh_hans: 列出所有已保存的数据库连接及其状态
zh_hant: 列出所有已儲存的資料庫連線及其狀態

source: Actual Time
fr: Heure réelle
ko: 실제 시간
tr: Gerçek Süre
vi: Thời gian thực tế
zh_hans: 实际耗时
zh_hant: 實際耗時

source: What ran it
fr: Ce qui l'a fait fonctionner
ko: 실행한 주체
tr: Onu neyin çalıştırdığı
vi: Thứ đã chạy nó
zh_hans: 运行它的是什么
zh_hant: 執行它的是什麼

source: Recording shortcut
fr: Accélération de l'enregistrement
ko: 단축키 기록 중
tr: Kısayol kaydediliyor
vi: Đang ghi phím tắt
zh_hans: 正在录制快捷键
zh_hant: 正在錄製快速鍵

source: ISO Date (2024-12-31)
fr: Date ISO (31-12-2024)
ko: ISO 날짜 (2024-12-31)
tr: ISO Tarih (2024-12-31)
vi: ISO ngày (2024-12-31)
zh_hans: ISO 日期 (2024-12-31)
zh_hant: ISO 日期 (2024-12-31)

source: Open-source fork of MySQL
fr: Fork open-source de MySQL
ko: MySQL의 오픈 소스 포크
tr: MySQL'in açık kaynaklı çatalı
vi: Bản fork mã nguồn mở của MySQL
zh_hans: MySQL 的开源分支
zh_hant: MySQL 的開源分支

source: e.g., Claude Code on VPS
fr: Par exemple, Claude Code sur VPS
ko: 예: VPS의 Claude Code
tr: örn. VPS üzerinde Claude Code
vi: ví dụ: Claude Code trên VPS
zh_hans: 例如，VPS 上的 Claude Code
zh_hant: 例如：VPS 上的 Claude Code

source: Its indexes are left out, because the target's index statements would name a different schema than its definition.
fr: Ses indices sont omis, car les déclarations d'index de la cible nommeraient un schéma différent de sa définition.

source: Queries you run appear here.
fr: Les requêtes que vous exécutez apparaissent ici.
ko: 실행한 쿼리가 여기에 표시됩니다.
tr: Çalıştırdığınız sorgular burada görünür.
vi: Các truy vấn bạn chạy sẽ xuất hiện ở đây.
zh_hans: 你运行的查询会显示在这里。
zh_hant: 你執行的查詢會顯示在這裡。

source: 1 plugin needs an update to load.
fr: 1 plugin nécessite une mise à jour pour être chargé.
ko: 1개 플러그인을 불러오려면 업데이트해야 합니다.
tr: 1 eklentinin yüklenmesi için güncelleme gerekiyor.
vi: 1 plugin cần cập nhật để tải.
zh_hans: 1个插件需要更新才能加载。
zh_hant: 1 個外掛需要更新才能載入。

source: Change the filter to see the other rows.
fr: Changez le filtre pour voir les autres lignes.
ko: 다른 행을 보려면 필터를 변경하십시오.
tr: Diğer satırları görmek için filtreyi değiştirin.
vi: Thay đổi bộ lọc để xem các dòng khác.
zh_hans: 更改筛选条件以查看其他行。
zh_hant: 變更篩選條件以查看其他列。

source: Fetch All
fr: Récupérer tout
ko: 모두 가져오기
tr: Tümünü Getir
vi: Tải tất cả
zh_hans: 获取全部
zh_hant: 取得全部

source: No measurable change
fr: Pas de changement mesurable
ko: 측정 가능한 변화 없음
tr: Ölçülebilir bir değişiklik yok
vi: Không có thay đổi đo được
zh_hans: 没有可测量的变化
zh_hant: 沒有可測量的變化

source: Apply Filter from Link
fr: Appliquer le filtre à partir du lien
ko: 링크의 필터 적용
tr: Bağlantıdan Filtre Uygula
vi: Áp dụng bộ lọc từ liên kết
zh_hans: 从链接应用筛选
zh_hant: 從連結套用篩選

source: First row
fr: Première rangée

source: Token
fr: Jeton
ko: 토큰
zh_hans: 令牌
zh_hant: 權杖

source: references itself
fr: Se réfère à lui-même

source: No Changes
fr: Aucune modification

source: Save Import Errors
fr: Sauvegarder les erreurs d'importation

source: A comparison is already running.
fr: Une comparaison est déjà en cours.
ko: 비교가 이미 실행 중입니다.
tr: Bir karşılaştırma zaten çalışıyor.
vi: Đã có một phiên so sánh đang chạy.
zh_hans: 已有比较正在运行。
zh_hant: 已有比較正在執行。

source: Another foreign key is already named %@.
fr: Une autre clé étrangère est déjà nommée %@.

source: Homepage
fr: Page d'accueil
ko: 홈페이지
tr: Ana Sayfa
vi: Trang chủ
zh_hans: 主页
zh_hant: 首頁

source: Choose an export file to import
fr: Choisissez un fichier d'exportation à importer.
ko: 가져올 내보내기 파일 선택
tr: İçe aktarılacak bir dışa aktarma dosyası seçin
vi: Chọn tệp xuất để nhập
zh_hans: 选择要导入的导出文件
zh_hant: 選擇要匯入的匯出檔案

source: Group name
fr: Nom du groupe
ko: 그룹 이름
tr: Grup adı
vi: Tên nhóm
zh_hans: 分组名称
zh_hant: 群組名稱

source: Empty %@ before copying
fr: Vider %@ avant de copier

source: Release
fr: Libération
ko: 해제
tr: Bırak
vi: Giải phóng
zh_hans: 释放
zh_hant: 釋出

source: TablePro could not open its query history database, so nothing is being recorded and nothing can be shown. Your existing history is still on disk.
fr: TablePro n'a pas pu ouvrir sa base de données d'historique des requêtes, donc rien n'est enregistré et rien ne peut être affiché. Votre historique existant est toujours sur disque.
ko: TablePro에서 쿼리 기록 데이터베이스를 열 수 없어 기록되거나 표시되는 항목이 없습니다. 기존 기록은 디스크에 그대로 남아 있습니다.
tr: TablePro sorgu geçmişi veritabanını açamadı, bu yüzden hiçbir şey kaydedilmiyor ve gösterilemiyor. Mevcut geçmişiniz hâlâ diskte.
vi: TablePro không mở được cơ sở dữ liệu lịch sử truy vấn, nên không có gì được ghi lại và không có gì để hiển thị. Lịch sử hiện có của bạn vẫn nằm trên đĩa.
zh_hans: TablePro 无法打开它的查询历史数据库，因此不会记录任何内容，也无法显示任何内容。你已有的历史仍在磁盘上。
zh_hant: TablePro 無法開啟它的查詢歷史資料庫，因此不會記錄任何內容，也無法顯示任何內容。你已有的記錄仍在磁碟上。

source: Browse
fr: Naviguer sur
ko: 찾아보기
tr: Gözat
vi: Duyệt
zh_hans: 浏览
zh_hant: 瀏覽

source: Max schema tables: %d
fr: Tables de schéma max : %d
ko: 최대 스키마 테이블 수: %d
tr: Maksimum şema tablosu: %d
vi: Số bảng tối đa: %d
zh_hans: 最大架构表数：%d
zh_hant: 綱要資料表上限：%d

source: Column reorder is not supported for this database type
fr: Le réordre des colonnes n'est pas pris en charge pour ce type de base de données.
ko: 이 데이터베이스 유형에서는 열 순서 변경을 지원하지 않습니다
tr: Bu veritabanı türü için sütun yeniden sıralama desteklenmiyor
vi: Sắp xếp lại cột không được hỗ trợ cho loại cơ sở dữ liệu này
zh_hans: 此数据库类型不支持列重排序
zh_hant: 此資料庫類型不支援欄位重新排序

source: Could not reach the license server. Check your internet connection and try again.
fr: Impossible d'atteindre le serveur de licence. Vérifiez votre connexion Internet et réessayez.
ko: 라이선스 서버에 연결할 수 없습니다. 인터넷 연결을 확인한 후 다시 시도하십시오.
tr: Lisans sunucusuna ulaşılamadı. İnternet bağlantınızı kontrol edip tekrar deneyin.
vi: Không thể kết nối đến máy chủ giấy phép. Kiểm tra kết nối internet và thử lại.
zh_hans: 无法连接许可证服务器。请检查网络连接后重试。
zh_hant: 無法連線授權伺服器。請檢查網際網路連線後再試一次。

source: Create the sequences %@ defaults from
fr: Créez les séquences par défaut %@ à partir de
